# Overview

In [1]:
import pandas as pd

pd.__version__

'1.0.3'

In [2]:
a = [1, 'a', None, True]

In [8]:
a

[1, 'a', None, True]

In [3]:
print(a[0])
print(a[3])

1
True

## Series

In [6]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

In [7]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [10]:
print(s['a'])
print(s['c'])
s[1]

3
7

-5

## DataFrame

In [12]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
        'Capital': ['Brussels', 'New Delhi', 'Brasília'],
        'Population': [11190846, 1303171035, 207847528]}

In [13]:
print(data['Country'])
data['Population']

['Belgium', 'India', 'Brazil']

[11190846, 1303171035, 207847528]

In [15]:
df = pd.DataFrame(data)
print(df)
pd.DataFrame(data, columns=['Country', 'Capital'])

Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

   Country    Capital
0  Belgium   Brussels
1    India  New Delhi
2   Brazil   Brasília

In [23]:
import numpy as np
data_dummy = pd.DataFrame(data=np.array([[1,'a',True], [2,'c',False]]), columns=['C1', 'C2', 'C3'])
data_dummy

  C1 C2     C3
0  1  a   True
1  2  c  False

## I/O

In [26]:
dataset = pd.read_csv('./jupyter/Cartwheeldata.csv')
dataset

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.00,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.00,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.00,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.00,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.00,75.0,72,N,0,4
5,6,24,M,2,N,0,75.00,71.0,81,N,0,3
6,7,28,M,2,N,0,75.00,76.0,107,Y,1,10
7,8,22,F,1,N,0,65.00,62.0,98,Y,1,9
8,9,29,M,2,Y,1,74.00,73.0,106,N,0,5
9,10,33,F,1,Y,1,63.00,60.0,65,Y,1,8
10,11,30,M,2,Y,1,69.50,66.0,96,Y,1,6
11,12,28,F,1,Y,1,62.75,58.0,79,Y,1,10
12,13,25,F,1,Y,1,65.00,64.5,92,Y,1,6
13,14,23,F,1,N,0,61.50,57.5,66,Y,1,4
14,15,31,M,2,Y,1,73.00,74.0,72,Y,1,9
15,16,26,M,2,Y,1,71.00,72.0,115,Y,1,6
16,17,26,F,1,N,0,61.50,59.5,90,N,0,10
17,18,27,M,2,N,0,66.00,66.0,74,Y,1,5
18,19,23,M,2,Y,1,70.00,69.0,64,Y,1,3
19,20,24,F,1,Y,1,68.00,66.0,85,Y,1,8
20,21,23,M,2,Y,1,69.00,67.0,66,N,0,2
21,22,29,M,2,N,0,71.00,70.0,101,Y,1,8
22,23,25,M,2,N,0,70.00,68.0,82,Y,1,4
23,24,26,M,2,N,0,69.00,71.0,63,Y,1,5
24,25,23,F,1,Y,1,65.00,63.0,67,N,0,3

In [25]:
data_dummy.to_csv('dummy.csv', index=None)

## INSPECT, SEARCH AND FILTER

In [28]:
print(dataset.shape)
print(dataset.shape[0])
print(dataset.shape[1])

(25, 12)
25
12

In [29]:
dataset.columns

Index(['ID', 'Age', 'Gender', 'GenderGroup', 'Glasses', 'GlassesGroup',
       'Height', 'Wingspan', 'CWDistance', 'Complete', 'CompleteGroup',
       'Score'],
      dtype='object')

In [30]:
dataset.dtypes

ID                 int64
Age                int64
Gender            object
GenderGroup        int64
Glasses           object
GlassesGroup       int64
Height           float64
Wingspan         float64
CWDistance         int64
Complete          object
CompleteGroup      int64
Score              int64
dtype: object

In [31]:
dataset.head()

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.0,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.0,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.0,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4

In [36]:
dataset.tail()

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
20,21,23,M,2,Y,1,69.0,67.0,66,N,0,2
21,22,29,M,2,N,0,71.0,70.0,101,Y,1,8
22,23,25,M,2,N,0,70.0,68.0,82,Y,1,4
23,24,26,M,2,N,0,69.0,71.0,63,Y,1,5
24,25,23,F,1,Y,1,65.0,63.0,67,N,0,3

In [37]:
dataset['Age'] # pd.Serie

0     56
1     26
2     33
3     39
4     27
5     24
6     28
7     22
8     29
9     33
10    30
11    28
12    25
13    23
14    31
15    26
16    26
17    27
18    23
19    24
20    23
21    29
22    25
23    26
24    23
Name: Age, dtype: int64

In [38]:
dataset[['Age']]

    Age
0    56
1    26
2    33
3    39
4    27
5    24
6    28
7    22
8    29
9    33
10   30
11   28
12   25
13   23
14   31
15   26
16   26
17   27
18   23
19   24
20   23
21   29
22   25
23   26
24   23

In [47]:
# dataframe(condicion) = ...
dataset[dataset['Gender']=='M']

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4
5,6,24,M,2,N,0,75.0,71.0,81,N,0,3
6,7,28,M,2,N,0,75.0,76.0,107,Y,1,10
8,9,29,M,2,Y,1,74.0,73.0,106,N,0,5
10,11,30,M,2,Y,1,69.5,66.0,96,Y,1,6
14,15,31,M,2,Y,1,73.0,74.0,72,Y,1,9
15,16,26,M,2,Y,1,71.0,72.0,115,Y,1,6
17,18,27,M,2,N,0,66.0,66.0,74,Y,1,5
18,19,23,M,2,Y,1,70.0,69.0,64,Y,1,3
20,21,23,M,2,Y,1,69.0,67.0,66,N,0,2
21,22,29,M,2,N,0,71.0,70.0,101,Y,1,8
22,23,25,M,2,N,0,70.0,68.0,82,Y,1,4
23,24,26,M,2,N,0,69.0,71.0,63,Y,1,5

In [48]:
dataset[dataset['ID']==5]

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4

## loc / iloc

In [56]:
# dataframe.loc[filtro_filas, filtro_columnas]
# OPERADORES CONDICIONES DENTRO DE DATAFRAME: &  |  ~
# Filtrar para: Genero=MUJERES / Edad>30 / Columnas: Height & CWDistance 
dataset.loc[(dataset['Gender']=='F') & 
            (dataset['Age']>30), ['Height', 'CWDistance']]# = 100.0

   Height  CWDistance
0   100.0       100.0
2   100.0       100.0
3   100.0       100.0
9   100.0       100.0

In [57]:
dataset.loc[(dataset['Gender']=='F') & 
            (dataset['Age']>30), :]

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,100.0,61.0,100.0,Y,1,7
2,3,33,F,1,Y,1,100.0,64.0,100.0,Y,1,7
3,4,39,F,1,N,0,100.0,63.0,100.0,Y,1,10
9,10,33,F,1,Y,1,100.0,60.0,100.0,Y,1,8

In [58]:
dataset.loc[:, ['Height', 'CWDistance']]

    Height  CWDistance
0   100.00       100.0
1    62.00        70.0
2   100.00       100.0
3   100.00       100.0
4    73.00        72.0
5    75.00        81.0
6    75.00       107.0
7    65.00        98.0
8    74.00       106.0
9   100.00       100.0
10   69.50        96.0
11   62.75        79.0
12   65.00        92.0
13   61.50        66.0
14   73.00        72.0
15   71.00       115.0
16   61.50        90.0
17   66.00        74.0
18   70.00        64.0
19   68.00        85.0
20   69.00        66.0
21   71.00       101.0
22   70.00        82.0
23   69.00        63.0
24   65.00        67.0

In [59]:
# x:y --> inicia en x: hasta antes de y
dataset.iloc[0:5, 3:6]

   GenderGroup Glasses  GlassesGroup
0            1       Y             1
1            1       Y             1
2            1       Y             1
3            1       N             0
4            2       N             0

## at / iat

In [69]:
dataset.at[5, 'Age']

24

In [67]:
dataset.iat[5, 8]

81.0

In [74]:
num_df = pd.DataFrame({'A':[1,2,3], 'B':[10,20,30], 'C':[9,8,7]})
num_df

   A   B  C
0  1  10  9
1  2  20  8
2  3  30  7

In [79]:
# tabla 1
num_df[num_df>8]
# tabla copia
df_copia = num_df[num_df>8].copy()

In [84]:
df_copia

    A   B    C
0 NaN  10  9.0
1 NaN  20  NaN
2 NaN  30  NaN

In [89]:
x = df_copia.loc[:, 'A']
x = 5
df_copia.loc[:, 'A'] = 5
print(x)
print(df_copia)

5
   A   B    C
0  5  10  9.0
1  5  20  NaN
2  5  30  NaN

In [92]:
print(pd.isna(df_copia))
pd.isna(df_copia).sum().sum()

A      B      C
0  False  False  False
1  False  False   True
2  False  False   True

2

In [94]:
df_copia.head()

   A   B    C
0  5  10  9.0

In [96]:
sum([1,2])

3

In [ ]:
A.sum()
B.sum()
C.sum()